app/views/webquests/_form.html.haml

SELECT "faches".* FROM "faches"
---
	.form-group
		=f.collection_select :fach_id, Fach.all, :id, :name, {promt: "Unterrichtsfach auswählen" }, input_html: {class: "form-control"}
	.form-group