app/controllers/webquests_controller.rb

	def index
		if params[:fach].blank?
			@webquests = Webquest.all.order("created_at DESC")
		else
			@fach_id = Fach.find_by(name: params[:fach]).id
			@webquests = Webquest.where(fach_id: @fach_id).order("created_at DESC")
---
SELECT "faches".* FROM "faches"
SELECT "webquests".* FROM "webquests"   ORDER BY created_at DESC
SELECT  "faches".* FROM "faches"  WHERE "faches"."name" = 'Geographie' LIMIT 1
SELECT "webquests".* FROM "webquests"  WHERE "webquests"."fach_id" = 5  ORDER BY created_at DESC

	def create
		@webquest = current_lehrer.webquests.build(webquest_params)

		if @webquest.save
---
INSERT INTO "webquests" ("beschreibung", "created_at", "fach", "lehrer_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["beschreibung", "bal baldfsdfnvijc"], ["created_at", "2015-01-30 10:21:47.457991"], ["fach", "Physik"], ["lehrer_id", 1], ["name", "Webquest Physik"], ["updated_at", "2015-01-30 10:21:47.457991"]]

	def update
		if @webquest.update(webquest_params)
---
UPDATE "webquests" SET "beschreibung" = ?, "name" = ?, "updated_at" = ? WHERE "webquests"."id" = 7  [["beschreibung", "fgbsdfbadfvadfv"], ["name", "dfxvsdfvsdfv"], ["updated_at", "2015-01-30 17:40:43.129275"]]

	def destroy
		@webquest.destroy
---
DELETE FROM "webquests" WHERE "webquests"."id" = ?  [["id", 1]]

	def find_webquest
		@webquest = Webquest.find(params[:id])
---
SELECT  "webquests".* FROM "webquests"  WHERE "webquests"."id" = ? LIMIT 1  [["id", 2]]